ent-WeaponRifleM90glGrenadeLauncherImperial = М-90gl
    .desc = Карабин старой модели, выполненный по схеме булл-пап, с подствольным гранатометом. Использует патроны калибра .45 .20 винтовочный.
    .suffix = { "" }

ent-CartridgeM90gl = патрон (.45 винтовочный разрывной)
    .desc = { "" }
    .suffix = { "" }

ent-MagazineM90gl = магазин (.45 винтовочные разрывные)
    .desc = { "" }
    .suffix = { "" }

ent-MagazineBoxM90gl = коробка патронов (.45 винтовочные разрывные)
    .desc = { "" }
    .suffix = { "" }

ent-ClothingBackpackDuffelSyndicateM90glImperial = набор "М-90gl"
    .desc = Карабин старой модели, выполненный по схеме булл-пап, с подствольным гранатометом. Поставляется в комплекте с 2 магазинами .45 разрывного калибра, и 2 магазинами .20 калибра.
    .suffix = { "" }